tutorials/viscoelasticFluidFoam/XPP_SE/system/sampleDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


interpolationScheme cellPointFace;

writeFormat     xmgr;

sampleSets
(

    face
    {
        name            magU_0;
        axis            distance;
        start           (0.076  0.0000001  0.0005);
        end             (0.084  0.0000001  0.0005);
        nPoints         200;
    }


    face
    {
        name            magU_04;
        axis            distance;
        start           (0.076  0.0004  0.0005);
        end             (0.084  0.0004  0.0005);
        nPoints         200;
    }


    face
    {
        name            magU_049;
        axis            distance;
        start           (0.076  0.00049  0.0005);
        end             (0.084  0.00049  0.0005);
        nPoints         200;
    }


);

fields
(
    mag(U)
);


// ************************************************************************* //
